'''
Создайте класс Figure. У каждой фигуры есть имя, также можно найти площадь и периметр фигуры. 
Создайте классы Triangle, Circle, Rectangle производные от Figure. 
У класса Triangle есть 3 стороны: a, b, c; у Circle - радиус r; у Rectangle - стороны a и b. 
Переопределите методы нахождения площади и периметра для каждой фигуры (Triangle, Circle, Rectangle). 
Также для объектов классов должны работать операторы сравнения: ==, >, < <=, >=. 
Будем считать, что фигуры равны, если они имеют одинаковую площадь. 
Строковое представление объекта должно возвращать тип фигуры и её имя.
Дополнительная функциональность приветствуется.
'''
