"""
Ex1
Продолжаем задачу из предыдущего урока
Используя дескрипторы, проверьте правильность введённых данных (a, b, c, d, r > 0).
square и perimeter -  теперь свойства. Обратите внимание, что при каждом обращении к square/perimeter
значения будут вычисляться заново. Подумайте, как это можно обойти,
т.е. значение должно вычисляться только при первом обращении к свойству.
"""


"""
Ex2
Напишите менеджер контекста MultiFileOpen, который позволяет работать с несколькими файлами: 
MultiFileOpen(('file1.txt', 'r'), ('file2.txt', 'w'), ..., ('fileN.txt', 'rb'))
"""


"""
Ex3
Напишите генератор fibonacci(n), который генерирует числа Фибоначчи до n включительно.
"""


"""
Ex4
Напишите генератор factorials(n), генерирующий последовательность факториалов натуральных чисел.
"""


"""
Ex5*
Напишите генератор binomial_coefficients(n), генерирующий последовательность биномиальных коэффициентов C0n,C1n,…,Cnn
Запрещается использовать факториалы.
"""


"""
Ex6
Напишите класс, объектом которого будет итератор производящий только чётные числа до n включительно.
"""

"""
Ex7
Напишите метакласс, который возводит имена всех аттрибутов класса в верхний регистр.
"""